tutorials/trainingTrack/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0e-05;

boundaryField
{
    walls
    {
        type            nutkWallFunction;
        value           uniform 1.0e-05;
    }

    down
    {
        type            nutkRoughWallFunction;
	Ks		uniform 1;
	Cs		uniform 0.5;
        value           uniform 1.0e-05;
    }

    "(inlet|top)"
    {
        type            zeroGradient;
    }

    outlet
    {
        type            nutkWallFunction;
	value		uniform 1.0e-05;
    }
}


// ************************************************************************* //
