tutorials/trainingTrack/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1584;
        startFace       196977;
    }
    down
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2160;
        startFace       198561;
    }
    top
    {
        type            patch;
        nFaces          480;
        startFace       200721;
    }
    inlet
    {
        type            patch;
        nFaces          660;
        startFace       201201;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2202;
        startFace       201861;
    }
)

// ************************************************************************* //
