tutorials/trainingTrack/system/fieldAverage1
    fieldAverage1
    {
        // Type of functionObject
        type            fieldAverage;

        // Where to load it from (if not already in solver)
        libs ("libfieldFunctionObjects.so");

        // Function object enabled flag
        enabled         true;

        // When to output the average fields
        writeControl   writeTime;
        
        restartOnRestart false;
        timeStart         2;
//        periodicRestart  true;
//        restartPeriod    50;
        

        // Fields to be averaged - runTime modifiable
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
                //window      0.01; // optional averaging window
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
                //window      0.01; // optional averaging window
            }
            
            wallShearStress
            {
                mean        on;
                prime2Mean  off;
                base        time;
                //window      0.01; // optional averaging window
            }

        );
    }

