tutorials/trainingTrack/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


turbine
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet; // cellSet || points || cellZone
        cellSet             refCylinder;
        origin              (0 0 0);
        axis                (1 0 0);
        verticalDirection   (0 1 0);
        freeStreamVelocity  (0 0 0);
        tipSpeedRatio       60.0;
        rotorRadius         0.05;
        angleVelocity       52.36;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          on;
            endEffectsModel Glauert; // Glauert || Shen || liftingLine
            GlauertCoeffs
            {
                tipEffects  on;
                rootEffects on;
            }
            ShenCoeffs
            {
                c1          0.125;
                c2          21;
                tipEffects  on;
                rootEffects on;
            }
        }

        blades
        {
            blade1
            {
                writePerf   true;
		writeVTK    true;
                writeElementPerf true;
                nElements  8;
                elementProfiles
                (
                    //cylinder
                    Ka02
		    Ka03
            	    Ka04
		    Ka05
		    Ka06
		    Ka07
		    Ka08
		    Ka09
		    Ka10
                );
                elementData
                (
                    #include "elementData"
                );
            }
            blade2
            {
                $blade1;
                writePerf   false;
		writeVTK    true;
                writeElementPerf false;
                azimuthalOffset 90.0;
            }
            blade3
            {
                $blade2;
		writeVTK    true;
                azimuthalOffset 180.0;
            }
		
		blade4
            {
                $blade3;
                writePerf   false;
		writeVTK    true;
                writeElementPerf false;
                azimuthalOffset 270.0;
            }
        }



        profileData
        {
            Ka02
            {
                data (#include "../../resources/foilData/Ka4-70_02");
            }
	    Ka025
            {
                data (#include "../../resources/foilData/Ka4-70_025");
            }
		
	    Ka03
            {
                data (#include "../../resources/foilData/Ka4-70_03");
            }
	    Ka035
            {
                data (#include "../../resources/foilData/Ka4-70_035");
            }
	    Ka04
            {
                data (#include "../../resources/foilData/Ka4-70_04");
            }
	    Ka045
            {
                data (#include "../../resources/foilData/Ka4-70_045");
            }
	    Ka05
            {
                data (#include "../../resources/foilData/Ka4-70_05");
            }
	    Ka055
            {
                data (#include "../../resources/foilData/Ka4-70_055");
            }
	    Ka06
            {
                data (#include "../../resources/foilData/Ka4-70_06");
            }
	    Ka065
            {
                data (#include "../../resources/foilData/Ka4-70_065");
            }
	    Ka07
            {
                data (#include "../../resources/foilData/Ka4-70_07");
            }
	    Ka075
            {
                data (#include "../../resources/foilData/Ka4-70_075");
            }
	    Ka08
            {
                data (#include "../../resources/foilData/Ka4-70_08");
            }
	    Ka085
            {
                data (#include "../../resources/foilData/Ka4-70_085");
            }
	    Ka09
            {
                data (#include "../../resources/foilData/Ka4-70_09");
            }
	    Ka095
            {
                data (#include "../../resources/foilData/Ka4-70_095");
            }
	    Ka10
            {
                data (#include "../../resources/foilData/Ka4-70_10");
            }
            cylinder
            {
                data ((-180 0 1.1)(180 0 1.1));
		//data ((-180 0.2 0.5)(180 0.2 0.5));
            }
        }
    }
}

// ************************************************************************* //
